#define  _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
int main() {
	char a = 3;
	//char包含一个字节8bit，故要二进制截断
	//000000000000000000000011          32bit
	//00000011     a

	char b = 127;
	//000000000000000001111111
	//01111111    b

	//a+b如何计算 
	//整形提升：按照变量的数据类型的符号位来提升的
	//有符号数：正数补0  负数补1
	//无符号数：直接补0
	char c = a + b;
    //000000000000000000000011   a
	//000000000000000001111111   b
	//000000000000000010000010   a+b
	 
	//10000010     c
	//111111111111111110000010    补码
	//111111111111111110000001    反码
    //100000000000000001111110    原码
		//-126
	printf("%d\n", c);
	return 0;
}